using System;

namespace Task_02
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
/*
 

Больница
    
    Отделение_01
        - параметры:
            Кабинет
            Имя врача
        - методы
            Прием больных
                Больной
                Диагноз
            Оказание помощи
                Больной
                Диагноз
                Дейстывия
        
    Отделение_02
        - параметры:
            Кабинет
            Имя врача
        - методы
            Прием больных
                Больной
                Диагноз
            Оказание помощи
                Больной
                Диагноз
                Дейстывия

    Отделение_03


/*
Имеем больницу с различными отделениями.
В некоторых отделениях есть приём людей на консультацию,
а в некоторых только для оказания неотложной помощи.
*/