//ToDo:   Задание 03   --
/*
   Числовые значения символов нижнего регистра в коде ASCII
отличаются от значений символов верхнего регистра на
величину 32. Используя эту информацию, написать про-
грамму, которая считывает с клавиатуры и конвертирует
Домашнее задание №1 все символы нижнего регистра в символы верхнего ре-
гистра и наоборот.
*/
using System;

namespace Task_03
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
//Signature - подпись
/*
-------------------------------------------
|                                         |
|   "Компьютерная академия ШАГ"           |
|   Курс: PD_011                          |
|   Предмет: Платформа Microsoft .NET     |
|            и язык программирования C#   |
|                                         |
|   Исполнитель: Курицын Алексей          |
|   Преподаватель: Старинин Андрей        |
|                                         |
|   Екатеринбург - 2021                   |
|                                         |
-------------------------------------------*/